#print("Hello world")

#1. Напишите программу, которая принимает на вход два числа и проверяет, является ли одно число квадратом другого.
    
 #   *Примеры:* 
    
  #  - 5, 25 -> да
   # - 4, 16 -> да
    #- 25, 5 -> да
    #- 8,9 -> нет
#print ("Введите первое число: ")   

#print ("Введите второе число: ")  

# a = int(input("Введите первое число: "))
# b = int(input("Введите второе число: "))

# if a == b*b or b == a*a:
#     print ("Число является квадратом другого числа")
# else:
#     print ("Число не является квадратом другого числа")

print("Введите число: ")

f = int(input())
a ="   _~_    \n"
b ="  (0 0)   \n"
c =" /  v  \  \n"
d ="/(  _  )\ \n"
e ="  ^^ ^^   \n"

print(f*str(a+b+c+d+e))