# Реализуйте алгоритм перемешивания списка.

import random

N = int(input('Введите число : '))
spis = list(range(1, N+1))
print('Первоначальный список: ', spis)


